{"id":12,"date":"2017-02-07T08:27:27","date_gmt":"2017-02-07T08:27:27","guid":{"rendered":"https:\/\/raratheme.com\/preview\/preschool-and-kindergarten\/?p=12"},"modified":"2017-02-07T08:27:27","modified_gmt":"2017-02-07T08:27:27","slug":"learning-is-fun-at-kinder-school","status":"publish","type":"post","link":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/2017\/02\/07\/learning-is-fun-at-kinder-school\/","title":{"rendered":"Learning is fun at Kinder School"},"content":{"rendered":"<p>Kindergarten from German which literally means &#8220;garden for the children&#8221;) is a preschool educational approach traditionally based on playing, singing, practical activities such as drawing, and social interaction as part of the transition from home to school. The first such institutions were created in the late 18th century in Bavaria and Strasbourg to serve children whose parents both worked out of the home. The term was coined by the German Friedrich Fröbel, whose approach globally influenced early-years education. Today, the term is used in many countries to describe a variety of educational institutions and learning spaces for children ranging from two to seven years of age, based on a variety of teaching methods.In 1779, Johann Friedrich Oberlin and Louise Scheppler founded in Strasbourg an early establishment for caring for and educating pre-school children whose parents were absent during the day.]At about the same time, in 1780, similar infant establishments were established in Bavaria. In 1802, Princess Pauline zur Lippe established a preschool center in Detmold, the capital of the then principality of Lippe, Germany (now in the State of North Rhine-Westphalia).<\/p>\n<p>In 1816, Robert Owen, a philosopher and pedagogue, opened the first British and probably globally the first infants school in New Lanark, Scotland. In conjunction with his venture for cooperative mills Owen wanted the children to be given a good moral education so that they would be fit for work. His system was successful in producing obedient children with basic literacy and numeracy.<\/p>\n<p>Samuel Wilderspin opened his first infant school in London in 1819,[8] and went on to establish hundreds more. He published many works on the subject, and his work became the model for infant schools throughout England and further afield. Play was an important part of Wilderspin&#8217;s system of education. He is credited with inventing the playground. In 1823, Wilderspin published On the Importance of Educating the Infant Poor, based on the school. He began working for the Infant School Society the next year, informing others about his views. He also wrote The Infant System, for developing the physical, intellectual, and moral powers of all children from 1 to seven years of age.<\/p>\n<p>Countess Theresa Brunszvik (1775–1861), who had known and been influenced by Johann Heinrich Pestalozzi, was influenced by this example to open an Angyalkert (&#8220;angel garden&#8221; in Hungarian) on May 27, 1828, in her residence in Buda, the first of eleven care centers that she founded for young children.In 1836 she established an institute for the foundation of preschool centers. The idea became popular among the nobility and the middle class and was copied throughout the Kingdom of Hungary.<\/p>\n<p>Friedrich Fröbel (1782–1852) opened a &#8220;play and activity&#8221; institute in 1837 in the village of Bad Blankenburg in the principality of Schwarzburg-Rudolstadt, Thuringia, as an experimental social experience for children entering school. He renamed his institute Kindergarten on June 28, 1840, reflecting his belief that children should be nurtured and nourished &#8220;like plants in a garden&#8221;.<\/p>\n<p>Women trained by Fröbel opened kindergartens throughout Europe and around the world. The first kindergarten in the US was founded in Watertown, Wisconsin in 1856 and was conducted in German.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kindergarten from German which literally means &#8220;garden for the children&#8221;) is a preschool educational approach<\/p>\n","protected":false},"author":1,"featured_media":176,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[4],"tags":[],"_links":{"self":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/12"}],"collection":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/comments?post=12"}],"version-history":[{"count":0,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/12\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media\/176"}],"wp:attachment":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media?parent=12"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/categories?post=12"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/tags?post=12"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}