{"id":29,"date":"2017-02-07T09:20:28","date_gmt":"2017-02-07T09:20:28","guid":{"rendered":"https:\/\/raratheme.com\/preview\/preschool-and-kindergarten\/?p=29"},"modified":"2017-02-07T09:20:28","modified_gmt":"2017-02-07T09:20:28","slug":"subset-of-early-childhood-education","status":"publish","type":"post","link":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/2017\/02\/07\/subset-of-early-childhood-education\/","title":{"rendered":"Subset of early childhood education"},"content":{"rendered":"<p>Early childhood education often focuses on learning through play, based on the research and philosophy of Jean Piaget, which posits that play meets the physical, intellectual, language, emotional and social needs  of children. Children&#8217;s curiosity and imagination naturally evoke learning when unfettered. Learning through play will allow a child to develop cognitively. Thus, children learn more efficiently and gain more knowledge through activities such as dramatic play, art, and social games.<\/p>\n<p>Tassoni suggests that &#8220;some play opportunities will develop specific individual areas of development, but many will develop several areas.&#8221;Thus, It is important that practitioners promote children’s development through play by using various types of play on a daily basis. Allowing children to help get snacks ready helps develop math skills (one-to-one ratio, patterns, etc.), leadership, and communication. Key guidelines for creating a play-based learning environment include providing a safe space, correct supervision, and culturally aware, trained teachers who are knowledgeable about the Early Years Foundation.<\/p>\n<p>Davy states that the British Children&#8217;s Act of 1989 links to play-work as the act works with play workers and sets the standards for the setting such as security, quality and staff ratios. Learning through play has been seen regularly in practice as the most versatile way a child can learn. Margaret McMillan (1860-1931) suggested that children should be given free school meals, fruit and milk, and plenty of exercise to keep them physically and emotionally healthy. Rudolf Steiner (1861-1925) believed that play time allows children to talk, socially interact, use their imagination and intellectual skills. Marie Montessori (1870-1952) believed that children learn through movement and their senses and after doing an activity using their senses.<\/p>\n<p>In a more contemporary approach, organizations such as the National Association of the Education of Young Children (NAEYC) promote child-guided learning experiences, individualized learning, and developmentally appropriate learning as tenets of early childhood education.<\/p>\n<p>Piaget provides an explanation for why learning through play is such a crucial aspect of learning as a child. However, due to the advancement of technology, the art of play has started to dissolve and has transformed into &#8220;playing&#8221; through technology. Greenfield, quoted by the author, Stuart Wolpert, in the article, &#8220;Is Technology Producing a Decline in Critical Thinking and Analysis?&#8221;, states, &#8220;No media is good for everything. If we want to develop a variety of skills, we need a balanced media diet. Each medium has costs and benefits in terms of what skills each develops.&#8221; Technology is beginning to invade the art of play and a balance needs to be found.<\/p>\n<p>Many oppose the theory of learning through play because they think children are not gaining new knowledge. In reality, play is the first way children learn to make sense of the world at a young age. As children watch adults interact around them, they pick up on their slight nuances, from facial expressions to their tone of voice. They are exploring different roles, learning how things work, and learning to communicate and work with others. These things cannot be taught by a standard curriculum, but have to be developed through the method of play. Many preschools understand the importance of play and have designed their curriculum around that to allow children to have more freedom. Once these basics are learned at a young age, it sets children up for success throughout their schooling and their life.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Early childhood education often focuses on learning through play, based on<\/p>\n","protected":false},"author":1,"featured_media":13,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[4],"tags":[],"_links":{"self":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/29"}],"collection":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/comments?post=29"}],"version-history":[{"count":0,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/29\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media\/13"}],"wp:attachment":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media?parent=29"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/categories?post=29"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/tags?post=29"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}