{"id":52,"date":"2017-02-07T10:45:04","date_gmt":"2017-02-07T10:45:04","guid":{"rendered":"https:\/\/raratheme.com\/preview\/preschool-and-kindergarten\/?p=52"},"modified":"2017-02-07T10:45:04","modified_gmt":"2017-02-07T10:45:04","slug":"active-learning","status":"publish","type":"post","link":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/2017\/02\/07\/active-learning\/","title":{"rendered":"Active Learning"},"content":{"rendered":"<p>Active learning is &#8220;a method of learning in which students are actively or experientially involved in the learning process and where there are different levels of active  learning, depending on student involvement.&#8221; (Weltman, p. 8) It is a model of instruction that focuses the responsibility of learning on learners.<\/p>\n<p>It was popularized in the 1990s by its appearance on the Association for the Study of Higher Education (ASHE) report (Bonwell &amp; Eison 1991). In this report they discuss a variety of methodologies for promoting &#8220;active learning&#8221;. They cite literature that indicates that to learn, students must do more than just listen: They must read, write, discuss, or be engaged in solving problems. It relates to the three learning domains referred to as knowledge, skills and attitudes (KSA), and that this taxonomy of learning behaviours can be thought of as &#8220;the goals of the learning process&#8221; (Bloom, 1956). In particular, students must engage in such higher-order thinking tasks as analysis, synthesis, and evaluation.Active learning engages students in two aspects – doing things and thinking about the things they are doing (Bonwell and Eison, 1991). L. Dee Fink suggests a model for conceptualizing the learning process that might assist teachers in identifying meaningful forms of active learning (dialogue, observing, doing).There are diverse range of alternatives for the term &#8220;active learning&#8221; like learning through play, technology based learning, activity based learning, group work, project method, etc. the underlying factor behind these are some significant qualities and characteristics of active learning.<\/p>\n<p>Active learning is the opposite of passive learning; it is learner-centered, not teacher-centered, and requires more than just listening; active participation of each and every student is a necessary aspect in active learning. Students must be doing things and simultaneously think about the work done and the purpose behind it so that they can enhance their higher order thinking capabilities. Many research studies have proven that active learning as a strategy has promoted achievement levels and some others say that content mastery is possible through active learning strategies. However, some students as well as teachers find it difficult to adapt to the new learning technique.<\/p>\n<p>Active learning should transform students from passive listeners to active participants, helps the student understand the subject through inquiry, gathering and analyzing data to solving higher order cognitive problems. There is intensive use of scientific and quantitative literacy across the curriculum and technology based learning is also in high demand in concern with active learning.[5] Barnes (1989) suggested principles of active learning:<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Active learning is &#8220;a method of learning in which students are actively or experientially involved in the learning process and where there are different levels of active  <\/p>\n","protected":false},"author":1,"featured_media":97,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/52"}],"collection":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/comments?post=52"}],"version-history":[{"count":0,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/posts\/52\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media\/97"}],"wp:attachment":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media?parent=52"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/categories?post=52"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/tags?post=52"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}