{"id":37,"date":"2017-02-07T06:41:05","date_gmt":"2017-02-07T06:41:05","guid":{"rendered":"https:\/\/raratheme.com\/preview\/preschool-and-kindergarten\/?page_id=37"},"modified":"2017-02-07T06:41:05","modified_gmt":"2017-02-07T06:41:05","slug":"welcome-to-kinder-school","status":"publish","type":"page","link":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/welcome-to-kinder-school\/","title":{"rendered":"Welcome to Kinder School"},"content":{"rendered":"<p>In recent decades, studies have shown that early childhood education is critical in preparing children to enter and succeed in the (grade school) classroom, diminishing their risk of social-emotional mental health problems and increasing their self-sufficiency as adults.<\/p>\n<p>In other words, the child needs to be taught to rationalize everything and to be open to interpretations and critical thinking. There is no subject to be considered taboo, starting with the most basic knowledge of the world he lives in, and ending with deeper areas, such as morality, religion and science. Visual stimulus and response time as early as 3 months can be an indicator of verbal and performance IQ at age 4 years.<\/p>\n<p>By providing education in a child&#8217;s most formative years, ECE also has the capacity to pre-emptively begin closing the educational achievement gap between low and high-income students before formal schooling begins.Children of low socioeconomic status (SES) often begin school already behind their higher SES peers; on average, by the time they are three, children with high SES have three times the number of words in their vocabularies as children with low SES. Participation in ECE, however, has been proven to increase high school graduation rates, improve performance on standardized tests, and reduce both grade repetition and the number of children placed in special education.<\/p>\n<p>Especially since the first wave of results from the Perry Preschool Project were published, there has been widespread consensus that the quality of early childhood education programs correlate with gains in low-income children’s IQs and test scores, decreased grade retention, and lower special education rates.<\/p>\n<p>Several studies have reported that children enrolled in ECE increase their IQ scores by 4-11 points by age five, while a Milwaukee study reported a 25-point gain. In addition, students who had been enrolled in the Abecedarian Project, an often-cited ECE study, scored significantly higher on reading and math tests by age fifteen than comparable students who had not participated in early childhood programs. In addition, 36% of students in the Abecedarian Preschool Study treatment group would later enroll in four-year colleges compared to 14% of those in the control group.<\/p>\n<p>Beyond benefitting societal good, ECE also significantly impacts the socioeconomic outcomes of individuals. For example, by age 26, students who had been enrolled in Chicago Child-Parent Centers were less likely to be arrested, abuse drugs, and receive food stamps; they were more likely to have high school diplomas, health insurance and full-time employment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In recent decades, studies have shown that early childhood education is critical in preparing children to enter and succeed in the (grade school) classroom, diminishing their risk of social-emotional mental health problems and increasing their self-sufficiency as adults.<\/p>\n<p>In other words, the child needs to be taught to rationalize everything and to be open to interpretations and critical thinking. There is no subject to be considered taboo, starting with the most basic knowledge of the world he lives in, and ending with <\/p>\n","protected":false},"author":1,"featured_media":23,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"post-meta":{"_thumbnail_id":"23","_wp_page_template":"default","preschool_and_kindergarten_sidebar_layout":"right-sidebar","_jetpack_dont_email_post_to_subs":"1","_edit_lock":"1579841656:4"},"_links":{"self":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/pages\/37"}],"collection":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/comments?post=37"}],"version-history":[{"count":0,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/pages\/37\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media\/23"}],"wp:attachment":[{"href":"https:\/\/rarathemesdemo.com\/preschool-and-kindergarten\/wp-json\/wp\/v2\/media?parent=37"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}